bmunizteofilo/esp32s3_oscilloscope_2_channels/main/adc/adc_scope.c
/**
 * @file adc_scope.c
 * @brief Implementação da captura contínua do ADC com DMA e buffers para gráfico.
 */

#include "adc_scope.h"
#include <inttypes.h>
#include <limits.h>
#include <stdlib.h>
#include <string.h>
#include "esp_adc/adc_cali.h"
#include "esp_adc/adc_cali_scheme.h"
#include "esp_adc/adc_continuous.h"
#include "esp_check.h"
#include "esp_heap_caps.h"
#include "esp_log.h"
#include "freertos/FreeRTOS.h"
#include "freertos/semphr.h"
#include "freertos/task.h"
#include "soc/soc_caps.h"

/** @brief Tag de log do módulo de aquisição. */
static const char *TAG = "adc_scope";

/** @brief Tempo máximo de espera no `adc_continuous_read` em milissegundos. */
#define ADC_SCOPE_READ_TIMEOUT_MS  (10U)

/** @brief Bits de notificação usados pela task de aquisição. */
#define ADC_SCOPE_NOTIFY_DATA      (1UL << 0)
#define ADC_SCOPE_NOTIFY_CONTROL   (1UL << 1)

/** @brief Estado interno do módulo de aquisição. */
typedef struct {
    adc_scope_config_t config;                                 /**< Cópia local da configuração do usuário. */
    adc_continuous_handle_t adc_handle;                        /**< Handle do driver contínuo do ADC. */
    adc_cali_handle_t cali_handle[ADC_SCOPE_MAX_CHANNELS];     /**< Handle de calibração por canal. */
    TaskHandle_t task_handle;                                  /**< Task que consome frames do ADC. */
    SemaphoreHandle_t mutex;                                   /**< Mutex que protege buffers compartilhados. */
    SemaphoreHandle_t control_done;                            /**< Sinaliza o término de comandos start/stop. */
    uint8_t *read_buffer;                                      /**< Buffer temporário para leitura do driver contínuo. */
    int32_t *circular_mv_buffer[ADC_SCOPE_MAX_CHANNELS];       /**< Buffer circular de tensão em milivolts por canal. */
    int32_t *block_mv_buffer[ADC_SCOPE_MAX_CHANNELS];          /**< Buffer usado na captura em bloco por canal. */
    size_t circular_head[ADC_SCOPE_MAX_CHANNELS];              /**< Próxima posição de escrita no buffer circular de cada canal. */
    size_t circular_count[ADC_SCOPE_MAX_CHANNELS];             /**< Quantidade válida de amostras no buffer circular de cada canal. */
    size_t block_count[ADC_SCOPE_MAX_CHANNELS];                /**< Quantidade válida de amostras no buffer em bloco de cada canal. */
    size_t block_target;                                       /**< Quantidade alvo da captura em bloco corrente. */
    adc_scope_mode_t mode;                                     /**< Modo de aquisição ativo. */
    bool initialized;                                          /**< Indica se o módulo já foi inicializado. */
    bool started;                                              /**< Indica se o ADC contínuo já foi iniciado. */
    bool control_start_pending;                                /**< Indica requisição pendente de start. */
    bool control_stop_pending;                                 /**< Indica requisição pendente de stop. */
    bool calibrated[ADC_SCOPE_MAX_CHANNELS];                   /**< Indica se o esquema de calibração foi criado por canal. */
    bool block_capture_ready;                                  /**< Indica se a captura em bloco foi concluída. */
    bool overflow_seen;                                        /**< Indica se ocorreu overflow do pool do driver. */
    uint32_t latest_raw[ADC_SCOPE_MAX_CHANNELS];               /**< Último valor bruto recebido por canal. */
    int32_t latest_mv[ADC_SCOPE_MAX_CHANNELS];                 /**< Último valor convertido por canal. */
    int gpio_num[ADC_SCOPE_MAX_CHANNELS];                      /**< GPIO físico associado a cada canal configurado. */
    esp_err_t control_result;                                  /**< Resultado do último comando de start/stop. */
} adc_scope_state_t;

/** @brief Estado global do módulo. Mantido em RAM interna para interação com ISR. */
static adc_scope_state_t s_scope = {
    .gpio_num = {-1, -1},
};

/**
 * @brief Retorna o índice lógico de um canal dentro da configuração ativa.
 *
 * @param[in] unit Unidade reportada pela amostra DMA.
 * @param[in] channel Canal reportado pela amostra DMA.
 *
 * @return Índice lógico do canal ou `-1` quando a amostra não pertence ao escopo.
 */
static int adc_scope_find_channel_index(adc_unit_t unit, adc_channel_t channel)
{
    if (unit != s_scope.config.unit) {
        return -1;
    }

    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        if (s_scope.config.channels[i] == channel) {
            return (int)i;
        }
    }

    return -1;
}

/**
 * @brief Retorna o menor contador de histórico disponível entre os canais ativos.
 *
 * @param[in] circular_source Indica se a origem é o buffer circular.
 *
 * @return Quantidade de amostras válidas compartilhadas.
 */
static size_t adc_scope_get_shared_count_locked(bool circular_source)
{
    size_t count = SIZE_MAX;

    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        const size_t current = circular_source ? s_scope.circular_count[i] : s_scope.block_count[i];
        if (current < count) {
            count = current;
        }
    }

    return (count == SIZE_MAX) ? 0U : count;
}

/**
 * @brief Lê uma amostra relativa ao início lógico do histórico de um canal.
 *
 * @param[in] channel_index Índice lógico do canal.
 * @param[in] circular_source Indica se a origem é o buffer circular.
 * @param[in] oldest_start Índice do elemento mais antigo no buffer circular do canal.
 * @param[in] rel_index Índice relativo a partir do início lógico da origem.
 *
 * @return Amostra em milivolts.
 */
static int32_t adc_scope_get_source_sample_locked(size_t channel_index,
                                                  bool circular_source,
                                                  size_t oldest_start,
                                                  size_t rel_index)
{
    if (circular_source) {
        return s_scope.circular_mv_buffer[channel_index][(oldest_start + rel_index) % s_scope.config.circular_buffer_capacity];
    }

    return s_scope.block_mv_buffer[channel_index][rel_index];
}

/**
 * @brief Renderiza uma janela do histórico real de um canal no buffer do gráfico.
 *
 * @param[in] channel_index Índice lógico do canal.
 * @param[in] circular_source Indica se a origem é o buffer circular.
 * @param[in] oldest_start Índice do elemento mais antigo no buffer circular do canal.
 * @param[in] window_start Índice relativo inicial da janela.
 * @param[in] window_len Quantidade de amostras reais na janela.
 * @param[out] dest Buffer de destino do gráfico.
 * @param[in] point_count Quantidade de pontos do gráfico.
 * @param[out] out_min_mv Menor valor encontrado na janela.
 * @param[out] out_max_mv Maior valor encontrado na janela.
 */
static void adc_scope_render_window_locked(size_t channel_index,
                                           bool circular_source,
                                           size_t oldest_start,
                                           size_t window_start,
                                           size_t window_len,
                                           int32_t *dest,
                                           size_t point_count,
                                           int32_t *out_min_mv,
                                           int32_t *out_max_mv)
{
    int32_t min_mv = INT32_MAX;
    int32_t max_mv = INT32_MIN;

    if (dest == NULL) {
        if (out_min_mv != NULL) {
            *out_min_mv = 0;
        }
        if (out_max_mv != NULL) {
            *out_max_mv = 0;
        }
        return;
    }

    for (size_t i = 0; i < point_count; i++) {
        dest[i] = INT32_MAX;
    }

