bmunizteofilo/esp32s3_oscilloscope_2_channels/main/adc/adc_scope.c
    if (window_len == 0U) {
        if (out_min_mv != NULL) {
            *out_min_mv = 0;
        }
        if (out_max_mv != NULL) {
            *out_max_mv = 0;
        }
        return;
    }

    if (window_len == 1U) {
        const int32_t mv = adc_scope_get_source_sample_locked(channel_index, circular_source, oldest_start, window_start);
        for (size_t i = 0; i < point_count; i++) {
            dest[i] = mv;
        }
        if (out_min_mv != NULL) {
            *out_min_mv = mv;
        }
        if (out_max_mv != NULL) {
            *out_max_mv = mv;
        }
        return;
    }

    for (size_t i = 0; i < point_count; i++) {
        const size_t src_offset = (i * (window_len - 1U)) / (point_count - 1U);
        const int32_t mv = adc_scope_get_source_sample_locked(channel_index, circular_source, oldest_start, window_start + src_offset);
        dest[i] = mv;
        if (mv < min_mv) {
            min_mv = mv;
        }
        if (mv > max_mv) {
            max_mv = mv;
        }
    }

    if (out_min_mv != NULL) {
        *out_min_mv = (min_mv == INT32_MAX) ? 0 : min_mv;
    }
    if (out_max_mv != NULL) {
        *out_max_mv = (max_mv == INT32_MIN) ? 0 : max_mv;
    }
}

/**
 * @brief Calcula frequência e duty cycle usando a janela real de um canal.
 *
 * @param[in] channel_index Índice lógico do canal.
 * @param[in] circular_source Indica se a origem é o buffer circular.
 * @param[in] oldest_start Índice do elemento mais antigo no buffer circular do canal.
 * @param[in] window_start Índice relativo inicial da janela.
 * @param[in] window_len Quantidade de amostras reais na janela.
 * @param[in] threshold_mv Nível de trigger usado como referência.
 * @param[out] out_freq_tenths_hz Frequência estimada em décimos de hertz.
 * @param[out] out_duty_tenths_percent Duty estimado em décimos de porcentagem.
 * @param[out] out_valid Indica se as medições puderam ser calculadas.
 */
static void adc_scope_measure_window_locked(size_t channel_index,
                                            bool circular_source,
                                            size_t oldest_start,
                                            size_t window_start,
                                            size_t window_len,
                                            int32_t threshold_mv,
                                            uint32_t *out_freq_tenths_hz,
                                            uint32_t *out_duty_tenths_percent,
                                            bool *out_valid)
{
    size_t crossing_index[16] = {0};
    bool crossing_rising[16] = {0};
    size_t crossing_count = 0U;
    size_t period_start = 0U;
    size_t period_end = 0U;
    bool valid = false;

    if (out_freq_tenths_hz != NULL) {
        *out_freq_tenths_hz = 0U;
    }
    if (out_duty_tenths_percent != NULL) {
        *out_duty_tenths_percent = 0U;
    }
    if (out_valid != NULL) {
        *out_valid = false;
    }

    if (window_len < 3U || s_scope.config.sample_freq_hz == 0U) {
        return;
    }

    for (size_t i = 1U; i < window_len && crossing_count < (sizeof(crossing_index) / sizeof(crossing_index[0])); i++) {
        const int32_t prev = adc_scope_get_source_sample_locked(channel_index, circular_source, oldest_start, window_start + i - 1U);
        const int32_t curr = adc_scope_get_source_sample_locked(channel_index, circular_source, oldest_start, window_start + i);
        const bool rising = (prev < threshold_mv) && (curr >= threshold_mv);
        const bool falling = (prev > threshold_mv) && (curr <= threshold_mv);

        if (!rising && !falling) {
            continue;
        }

        crossing_index[crossing_count] = i;
        crossing_rising[crossing_count] = rising;
        crossing_count++;
    }

    for (size_t i = 0; (i + 2U) < crossing_count; i++) {
        if (crossing_rising[i] == crossing_rising[i + 2U]) {
            period_start = crossing_index[i];
            period_end = crossing_index[i + 2U];
            valid = (period_end > period_start);
            break;
        }
    }

    if (!valid) {
        return;
    }

    if (out_freq_tenths_hz != NULL) {
        const uint64_t numerator = (uint64_t)s_scope.config.sample_freq_hz * 10ULL;
        *out_freq_tenths_hz = (uint32_t)((numerator + ((period_end - period_start) / 2U)) / (uint64_t)(period_end - period_start));
    }

    if (out_duty_tenths_percent != NULL) {
        uint32_t high_samples = 0U;

        for (size_t i = period_start; i < period_end; i++) {
            const int32_t mv = adc_scope_get_source_sample_locked(channel_index, circular_source, oldest_start, window_start + i);
            if (mv >= threshold_mv) {
                high_samples++;
            }
        }

        *out_duty_tenths_percent = (uint32_t)(((uint64_t)high_samples * 1000ULL) / (uint64_t)(period_end - period_start));
    }

    if (out_valid != NULL) {
        *out_valid = true;
    }
}

/**
 * @brief Armazena uma amostra já convertida no modo circular.
 *
 * @param[in] channel_index Índice lógico do canal.
 * @param[in] mv Amostra convertida em milivolts.
 */
static void adc_scope_store_circular_sample_locked(size_t channel_index, int32_t mv)
{
    s_scope.circular_mv_buffer[channel_index][s_scope.circular_head[channel_index]] = mv;
    s_scope.circular_head[channel_index] = (s_scope.circular_head[channel_index] + 1U) % s_scope.config.circular_buffer_capacity;

    if (s_scope.circular_count[channel_index] < s_scope.config.circular_buffer_capacity) {
        s_scope.circular_count[channel_index]++;
    }
}

/**
 * @brief Armazena uma amostra no modo bloco, respeitando a quantidade solicitada.
 *
 * @param[in] channel_index Índice lógico do canal.
 * @param[in] mv Amostra convertida em milivolts.
 */
static void adc_scope_store_block_sample_locked(size_t channel_index, int32_t mv)
{
    bool all_done = true;

    if (s_scope.block_target == 0U || s_scope.block_capture_ready) {
        return;
    }

    if (s_scope.block_count[channel_index] < s_scope.block_target) {
        s_scope.block_mv_buffer[channel_index][s_scope.block_count[channel_index]++] = mv;
    }

    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        if (s_scope.block_count[i] < s_scope.block_target) {
            all_done = false;
            break;
        }
    }

    s_scope.block_capture_ready = all_done;
}

/**
 * @brief Converte uma amostra bruta do ADC para milivolts.
 *
 * @param[in] channel_index Índice lógico do canal.
 * @param[in] raw Valor bruto retornado pelo ADC.
 *
 * @return Amostra convertida em milivolts.
 */
static int32_t adc_scope_convert_raw_to_mv(size_t channel_index, uint32_t raw)
{
    int voltage_mv = (int)raw;

    if (s_scope.calibrated[channel_index]) {
        if (adc_cali_raw_to_voltage(s_scope.cali_handle[channel_index], (int)raw, &voltage_mv) != ESP_OK) {
            voltage_mv = (int)raw;
        }
    }

    return (int32_t)voltage_mv;
}

/**
 * @brief Processa um lote de frames lidos do ADC.
 *
 * @param[in] data Dados crus recebidos via `adc_continuous_read`.
 * @param[in] size Quantidade de bytes válidos em `data`.
 */
static void adc_scope_process_samples(const uint8_t *data, uint32_t size)
{
    if (xSemaphoreTake(s_scope.mutex, portMAX_DELAY) != pdTRUE) {
        return;
    }

    for (uint32_t offset = 0; offset + SOC_ADC_DIGI_RESULT_BYTES <= size; offset += SOC_ADC_DIGI_RESULT_BYTES) {
        const adc_digi_output_data_t *sample = (const adc_digi_output_data_t *)&data[offset];
        const adc_unit_t unit = sample->type2.unit ? ADC_UNIT_2 : ADC_UNIT_1;
        const adc_channel_t channel = (adc_channel_t)sample->type2.channel;
        const uint32_t raw = sample->type2.data;
        const int index = adc_scope_find_channel_index(unit, channel);
        int32_t mv = 0;

