bmunizteofilo/esp32s3_oscilloscope_2_channels/main/adc/adc_scope.c
        if (index < 0) {
            continue;
        }

        mv = adc_scope_convert_raw_to_mv((size_t)index, raw);
        s_scope.latest_raw[index] = raw;
        s_scope.latest_mv[index] = mv;

        if (s_scope.mode == ADC_SCOPE_MODE_CIRCULAR) {
            adc_scope_store_circular_sample_locked((size_t)index, mv);
        } else {
            adc_scope_store_block_sample_locked((size_t)index, mv);
        }
    }

    xSemaphoreGive(s_scope.mutex);
}

/**
 * @brief Callback disparada quando um frame DMA de conversões fica pronto.
 *
 * @param[in] handle Handle do ADC contínuo.
 * @param[in] edata Metadados do evento de conversão.
 * @param[in] user_data Contexto registrado no driver.
 *
 * @return `true` quando uma task de maior prioridade deve ser acordada.
 */
static bool IRAM_ATTR adc_scope_on_conv_done_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
{
    BaseType_t task_woken = pdFALSE;
    adc_scope_state_t *state = (adc_scope_state_t *)user_data;
    (void)handle;
    (void)edata;

    xTaskNotifyFromISR(state->task_handle, ADC_SCOPE_NOTIFY_DATA, eSetBits, &task_woken);
    return task_woken == pdTRUE;
}

/**
 * @brief Callback disparada quando o pool interno do driver sofre overflow.
 *
 * @param[in] handle Handle do ADC contínuo.
 * @param[in] edata Metadados do evento.
 * @param[in] user_data Contexto registrado no driver.
 *
 * @return `false`, pois não há troca imediata de contexto.
 */
static bool IRAM_ATTR adc_scope_on_pool_ovf_cb(adc_continuous_handle_t handle, const adc_continuous_evt_data_t *edata, void *user_data)
{
    adc_scope_state_t *state = (adc_scope_state_t *)user_data;
    (void)handle;
    (void)edata;

    state->overflow_seen = true;
    return false;
}

/**
 * @brief Task responsável por consumir os frames produzidos pelo ADC contínuo.
 *
 * @param[in] arg Contexto não utilizado.
 */
static void adc_scope_task(void *arg)
{
    (void)arg;

    while (true) {
        uint32_t notify_value = 0;
        uint32_t bytes_read = 0;
        esp_err_t ret = ESP_ERR_TIMEOUT;

        xTaskNotifyWait(0U, UINT32_MAX, &notify_value, pdMS_TO_TICKS(ADC_SCOPE_READ_TIMEOUT_MS));

        if (s_scope.control_stop_pending && s_scope.started) {
            s_scope.control_result = adc_continuous_stop(s_scope.adc_handle);
            if (s_scope.control_result == ESP_OK) {
                s_scope.started = false;
            }
            s_scope.control_stop_pending = false;
            xSemaphoreGive(s_scope.control_done);
        }

        if (s_scope.control_start_pending && !s_scope.started) {
            s_scope.control_result = adc_continuous_start(s_scope.adc_handle);
            if (s_scope.control_result == ESP_OK) {
                s_scope.started = true;
            }
            s_scope.control_start_pending = false;
            xSemaphoreGive(s_scope.control_done);
        }

        if (!s_scope.started) {
            continue;
        }

        do {
            ret = adc_continuous_read(s_scope.adc_handle,
                                      s_scope.read_buffer,
                                      s_scope.config.conv_frame_size,
                                      &bytes_read,
                                      0);
            if (ret == ESP_OK && bytes_read > 0U) {
                adc_scope_process_samples(s_scope.read_buffer, bytes_read);
            }
        } while (ret == ESP_OK && bytes_read > 0U);
    }
}

/**
 * @brief Retorna uma configuração padrão adequada para inicializar o módulo.
 *
 * @return Estrutura preenchida com valores iniciais seguros para o ESP32-S3.
 */
adc_scope_config_t adc_scope_get_default_config(void)
{
    const adc_scope_config_t config = {
        .unit = ADC_UNIT_1,
        .channel_count = 2U,
        .channels = {ADC_CHANNEL_9, ADC_CHANNEL_0},
        .attenuations = {ADC_ATTEN_DB_12, ADC_ATTEN_DB_12},
        .bitwidth = ADC_BITWIDTH_12,
        .sample_freq_hz = 20000U,
        .max_store_buf_size = 2048U,
        .conv_frame_size = 256U,
        .circular_buffer_capacity = 20000U,
        .chart_point_count = 240U,
        .default_block_sample_count = 240U,
        .task_priority = 5U,
        .task_stack_size = 4096U,
    };

    return config;
}

/**
 * @brief Inicializa o driver contínuo do ADC, a calibração e a task de aquisição.
 *
 * @param[in] config Configuração desejada para o módulo.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_init(const adc_scope_config_t *config)
{
    adc_continuous_handle_cfg_t handle_config = {0};
    adc_continuous_config_t adc_config = {0};
    adc_digi_pattern_config_t patterns[ADC_SCOPE_MAX_CHANNELS] = {0};
    adc_continuous_evt_cbs_t callbacks = {0};
    esp_err_t ret = ESP_OK;

    ESP_RETURN_ON_FALSE(config != NULL, ESP_ERR_INVALID_ARG, TAG, "config nulo");
    ESP_RETURN_ON_FALSE(config->channel_count > 0U && config->channel_count <= ADC_SCOPE_MAX_CHANNELS, ESP_ERR_INVALID_ARG, TAG, "channel_count invalido");
    ESP_RETURN_ON_FALSE(config->circular_buffer_capacity >= config->chart_point_count, ESP_ERR_INVALID_ARG, TAG, "historico circular invalido");
    ESP_RETURN_ON_FALSE(config->chart_point_count > 0U, ESP_ERR_INVALID_ARG, TAG, "chart_point_count invalido");
    ESP_RETURN_ON_FALSE(config->default_block_sample_count > 0U, ESP_ERR_INVALID_ARG, TAG, "default_block_sample_count invalido");
    ESP_RETURN_ON_FALSE(config->default_block_sample_count <= config->chart_point_count, ESP_ERR_INVALID_ARG, TAG, "bloco excede grafico");
    ESP_RETURN_ON_FALSE(config->conv_frame_size >= SOC_ADC_DIGI_RESULT_BYTES, ESP_ERR_INVALID_ARG, TAG, "frame DMA invalido");
    ESP_RETURN_ON_FALSE((config->conv_frame_size % SOC_ADC_DIGI_RESULT_BYTES) == 0U, ESP_ERR_INVALID_ARG, TAG, "frame DMA desalinhado");
    ESP_RETURN_ON_FALSE(config->unit == ADC_UNIT_1, ESP_ERR_INVALID_ARG, TAG, "somente ADC1 e suportado neste projeto");
    ESP_RETURN_ON_FALSE(!s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo ja inicializado");

