bmunizteofilo/esp32s3_oscilloscope_2_channels/main/adc/adc_scope.c
    memset(&s_scope, 0, sizeof(s_scope));
    for (size_t i = 0; i < ADC_SCOPE_MAX_CHANNELS; i++) {
        s_scope.gpio_num[i] = -1;
    }

    s_scope.config = *config;
    s_scope.mode = ADC_SCOPE_MODE_CIRCULAR;
    s_scope.block_target = config->default_block_sample_count;

    s_scope.mutex = xSemaphoreCreateMutex();
    ESP_RETURN_ON_FALSE(s_scope.mutex != NULL, ESP_ERR_NO_MEM, TAG, "falha ao criar mutex");
    s_scope.control_done = xSemaphoreCreateBinary();
    ESP_GOTO_ON_FALSE(s_scope.control_done != NULL, ESP_ERR_NO_MEM, err, TAG, "falha ao criar semaforo de controle");

    s_scope.read_buffer = heap_caps_malloc(config->conv_frame_size, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
    ESP_GOTO_ON_FALSE(s_scope.read_buffer != NULL, ESP_ERR_NO_MEM, err, TAG, "falha ao alocar read_buffer");

    for (size_t i = 0; i < config->channel_count; i++) {
        s_scope.circular_mv_buffer[i] = calloc(config->circular_buffer_capacity, sizeof(int32_t));
        s_scope.block_mv_buffer[i] = calloc(config->chart_point_count, sizeof(int32_t));
        ESP_GOTO_ON_FALSE(s_scope.circular_mv_buffer[i] != NULL, ESP_ERR_NO_MEM, err, TAG, "falha ao alocar buffer circular");
        ESP_GOTO_ON_FALSE(s_scope.block_mv_buffer[i] != NULL, ESP_ERR_NO_MEM, err, TAG, "falha ao alocar buffer bloco");
    }

    handle_config.max_store_buf_size = config->max_store_buf_size;
    handle_config.conv_frame_size = config->conv_frame_size;
    handle_config.flags.flush_pool = 1U;
    ESP_GOTO_ON_ERROR(adc_continuous_new_handle(&handle_config, &s_scope.adc_handle), err, TAG, "falha ao criar handle ADC");

    for (size_t i = 0; i < config->channel_count; i++) {
        patterns[i].atten = (uint8_t)config->attenuations[i];
        patterns[i].channel = (uint8_t)config->channels[i];
        patterns[i].unit = (uint8_t)config->unit;
        patterns[i].bit_width = (uint8_t)config->bitwidth;
    }

    adc_config.pattern_num = config->channel_count;
    adc_config.adc_pattern = patterns;
    adc_config.sample_freq_hz = config->sample_freq_hz * (uint32_t)config->channel_count;
    adc_config.conv_mode = ADC_CONV_SINGLE_UNIT_1;
    adc_config.format = ADC_DIGI_OUTPUT_FORMAT_TYPE2;
    ESP_GOTO_ON_ERROR(adc_continuous_config(s_scope.adc_handle, &adc_config), err, TAG, "falha ao configurar ADC continuo");

    callbacks.on_conv_done = adc_scope_on_conv_done_cb;
    callbacks.on_pool_ovf = adc_scope_on_pool_ovf_cb;
    ESP_GOTO_ON_ERROR(adc_continuous_register_event_callbacks(s_scope.adc_handle, &callbacks, &s_scope), err, TAG, "falha ao registrar callbacks");

#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    for (size_t i = 0; i < config->channel_count; i++) {
        const adc_cali_curve_fitting_config_t cali_config = {
            .unit_id = config->unit,
            .chan = config->channels[i],
            .atten = config->attenuations[i],
            .bitwidth = config->bitwidth,
        };

        ret = adc_cali_create_scheme_curve_fitting(&cali_config, &s_scope.cali_handle[i]);
        if (ret == ESP_OK) {
            s_scope.calibrated[i] = true;
        } else {
            ESP_LOGW(TAG, "Calibracao indisponivel no canal %u (%s). Seguiremos com valor cru.", (unsigned)i, esp_err_to_name(ret));
            ret = ESP_OK;
        }
    }
#endif

    for (size_t i = 0; i < config->channel_count; i++) {
        ESP_GOTO_ON_ERROR(adc_continuous_channel_to_io(config->unit, config->channels[i], &s_scope.gpio_num[i]), err, TAG, "falha ao resolver GPIO ADC");
    }

    BaseType_t task_ok = xTaskCreate(adc_scope_task,
                                     "adc_scope",
                                     config->task_stack_size,
                                     NULL,
                                     (UBaseType_t)config->task_priority,
                                     &s_scope.task_handle);
    ESP_GOTO_ON_FALSE(task_ok == pdPASS, ESP_ERR_NO_MEM, err, TAG, "falha ao criar task ADC");

    s_scope.initialized = true;
    ESP_LOGI(TAG,
             "ADC pronto: CH1 GPIO %d, CH2 GPIO %d, freq=%" PRIu32 " Hz/canal, pontos=%u",
             s_scope.gpio_num[0],
             (config->channel_count > 1U) ? s_scope.gpio_num[1] : -1,
             config->sample_freq_hz,
             (unsigned)config->chart_point_count);
    return ESP_OK;

err:
#if ADC_CALI_SCHEME_CURVE_FITTING_SUPPORTED
    for (size_t i = 0; i < ADC_SCOPE_MAX_CHANNELS; i++) {
        if (s_scope.cali_handle[i] != NULL) {
            adc_cali_delete_scheme_curve_fitting(s_scope.cali_handle[i]);
            s_scope.cali_handle[i] = NULL;
        }
    }
#endif
    if (s_scope.adc_handle != NULL) {
        adc_continuous_deinit(s_scope.adc_handle);
        s_scope.adc_handle = NULL;
    }
    for (size_t i = 0; i < ADC_SCOPE_MAX_CHANNELS; i++) {
        if (s_scope.block_mv_buffer[i] != NULL) {
            free(s_scope.block_mv_buffer[i]);
            s_scope.block_mv_buffer[i] = NULL;
        }
        if (s_scope.circular_mv_buffer[i] != NULL) {
            free(s_scope.circular_mv_buffer[i]);
            s_scope.circular_mv_buffer[i] = NULL;
        }
    }
    if (s_scope.read_buffer != NULL) {
        heap_caps_free(s_scope.read_buffer);
        s_scope.read_buffer = NULL;
    }
    if (s_scope.mutex != NULL) {
        vSemaphoreDelete(s_scope.mutex);
        s_scope.mutex = NULL;
    }
    if (s_scope.control_done != NULL) {
        vSemaphoreDelete(s_scope.control_done);
        s_scope.control_done = NULL;
    }
    return ret;
}

/**
 * @brief Inicia a aquisição contínua de amostras pelo ADC com DMA.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_start(void)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");
    ESP_RETURN_ON_FALSE(!s_scope.started, ESP_ERR_INVALID_STATE, TAG, "ADC ja iniciado");

    s_scope.control_result = ESP_ERR_INVALID_STATE;
    s_scope.control_start_pending = true;
    xTaskNotify(s_scope.task_handle, ADC_SCOPE_NOTIFY_CONTROL, eSetBits);
    if (xSemaphoreTake(s_scope.control_done, pdMS_TO_TICKS(250)) != pdTRUE) {
        s_scope.control_start_pending = false;
        return ESP_ERR_TIMEOUT;
    }

    ESP_RETURN_ON_ERROR(s_scope.control_result, TAG, "falha ao iniciar ADC continuo");
    return ESP_OK;
}

/**
 * @brief Interrompe a aquisição contínua de amostras pelo ADC com DMA.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_stop(void)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");
    ESP_RETURN_ON_FALSE(s_scope.started, ESP_ERR_INVALID_STATE, TAG, "ADC nao iniciado");

    s_scope.control_result = ESP_ERR_INVALID_STATE;
    s_scope.control_stop_pending = true;
    xTaskNotify(s_scope.task_handle, ADC_SCOPE_NOTIFY_CONTROL, eSetBits);
    if (xSemaphoreTake(s_scope.control_done, pdMS_TO_TICKS(250)) != pdTRUE) {
        s_scope.control_stop_pending = false;
        return ESP_ERR_TIMEOUT;
    }

    ESP_RETURN_ON_ERROR(s_scope.control_result, TAG, "falha ao interromper ADC continuo");
    return ESP_OK;
}

/**
 * @brief Altera o modo de aquisição entre circular e bloco.
 *
 * @param[in] mode Novo modo desejado.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_set_mode(adc_scope_mode_t mode)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");

    if (xSemaphoreTake(s_scope.mutex, portMAX_DELAY) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    s_scope.mode = mode;
    if (mode == ADC_SCOPE_MODE_CIRCULAR) {
        s_scope.block_capture_ready = false;
    } else {
        for (size_t i = 0; i < s_scope.config.channel_count; i++) {
            s_scope.block_count[i] = 0U;
        }
        s_scope.block_target = s_scope.config.default_block_sample_count;
        s_scope.block_capture_ready = false;
    }

    xSemaphoreGive(s_scope.mutex);
    return ESP_OK;
}

/**
 * @brief Prepara uma nova captura em bloco com quantidade configurável de amostras.
 *
 * @param[in] sample_count Quantidade desejada de amostras. Se zero, usa o valor padrão.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_capture_block(size_t sample_count)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");

    if (sample_count == 0U) {
        sample_count = s_scope.config.default_block_sample_count;
    }

