bmunizteofilo/esp32s3_oscilloscope_2_channels/main/adc/adc_scope.c
    ESP_RETURN_ON_FALSE(sample_count <= s_scope.config.chart_point_count, ESP_ERR_INVALID_ARG, TAG, "sample_count excede grafico");

    if (xSemaphoreTake(s_scope.mutex, portMAX_DELAY) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    s_scope.mode = ADC_SCOPE_MODE_BLOCK;
    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        s_scope.block_count[i] = 0U;
    }
    s_scope.block_target = sample_count;
    s_scope.block_capture_ready = false;

    xSemaphoreGive(s_scope.mutex);
    return ESP_OK;
}

/**
 * @brief Copia janelas alinhadas de até dois canais para buffers do gráfico.
 *
 * @param[out] dest_per_channel Vetor com buffers de destino por canal. Posições `NULL` serão ignoradas.
 * @param[in] point_count Quantidade de posições de cada buffer de destino.
 * @param[in] requested_samples Quantidade de amostras reais desejadas para compor a janela.
 * @param[in] trigger_mode Tipo de borda usada pelo trigger.
 * @param[in] trigger_run_mode Modo de execução do trigger.
 * @param[in] trigger_channel_index Índice do canal usado como referência do trigger.
 * @param[in] trigger_point_index Posição horizontal desejada para a borda de trigger no gráfico.
 * @param[in] history_offset_samples Quantidade de amostras recuadas em relação ao trecho mais recente.
 * @param[in] trigger_level_mv Nível de trigger em milivolts ou `INT32_MIN` para automático.
 * @param[in] trigger_hysteresis_mv Histerese em milivolts ou `0` para automático.
 * @param[out] out_snapshot Estrutura opcional com metadados da janela copiada.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_copy_chart_points_multi(int32_t *dest_per_channel[ADC_SCOPE_MAX_CHANNELS],
                                            size_t point_count,
                                            size_t requested_samples,
                                            adc_scope_trigger_mode_t trigger_mode,
                                            adc_scope_trigger_run_mode_t trigger_run_mode,
                                            size_t trigger_channel_index,
                                            size_t trigger_point_index,
                                            size_t history_offset_samples,
                                            int32_t trigger_level_mv,
                                            uint32_t trigger_hysteresis_mv,
                                            adc_scope_snapshot_t *out_snapshot)
{
    adc_scope_snapshot_t snapshot = {0};
    size_t oldest_start[ADC_SCOPE_MAX_CHANNELS] = {0};
    size_t count = 0U;
    size_t window_start = 0U;
    size_t window_len = 0U;
    bool circular_source = false;

    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");
    ESP_RETURN_ON_FALSE(dest_per_channel != NULL, ESP_ERR_INVALID_ARG, TAG, "destinos nulos");
    ESP_RETURN_ON_FALSE(point_count == s_scope.config.chart_point_count, ESP_ERR_INVALID_ARG, TAG, "point_count divergente");
    ESP_RETURN_ON_FALSE(requested_samples > 0U, ESP_ERR_INVALID_ARG, TAG, "requested_samples invalido");
    ESP_RETURN_ON_FALSE(trigger_channel_index < s_scope.config.channel_count, ESP_ERR_INVALID_ARG, TAG, "trigger_channel_index invalido");
    ESP_RETURN_ON_FALSE(trigger_point_index < point_count, ESP_ERR_INVALID_ARG, TAG, "trigger_point_index invalido");

    if (xSemaphoreTake(s_scope.mutex, pdMS_TO_TICKS(5)) != pdTRUE) {
        return ESP_ERR_TIMEOUT;
    }

    snapshot.mode = s_scope.mode;
    snapshot.channel_count = s_scope.config.channel_count;
    snapshot.capacity = point_count;
    snapshot.history_capacity = (s_scope.mode == ADC_SCOPE_MODE_CIRCULAR) ? s_scope.config.circular_buffer_capacity : s_scope.block_target;
    snapshot.capture_ready = s_scope.block_capture_ready;
    snapshot.acquisition_running = s_scope.started;
    snapshot.trigger_found = false;
    snapshot.overflow_seen = s_scope.overflow_seen;
    snapshot.trigger_channel_index = trigger_channel_index;
    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        snapshot.latest_raw[i] = s_scope.latest_raw[i];
        snapshot.latest_mv[i] = s_scope.latest_mv[i];
        snapshot.calibrated[i] = s_scope.calibrated[i];
        snapshot.min_mv[i] = 0;
        snapshot.max_mv[i] = 0;
        snapshot.frequency_tenths_hz[i] = 0U;
        snapshot.duty_tenths_percent[i] = 0U;
        snapshot.measurements_valid[i] = false;
    }

    circular_source = (s_scope.mode == ADC_SCOPE_MODE_CIRCULAR);
    count = adc_scope_get_shared_count_locked(circular_source);
    snapshot.history_count = count;

    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        if (circular_source) {
            oldest_start[i] = (s_scope.circular_head[i] + s_scope.config.circular_buffer_capacity - s_scope.circular_count[i]) % s_scope.config.circular_buffer_capacity;
        }
    }

    if (history_offset_samples > count) {
        history_offset_samples = count;
    }

    if (count > history_offset_samples) {
        count -= history_offset_samples;
    } else {
        count = 0U;
    }

    window_len = (requested_samples < count) ? requested_samples : count;
    window_start = (count > window_len) ? (count - window_len) : 0U;

    if (trigger_mode != ADC_SCOPE_TRIGGER_FREE && requested_samples > 1U && count >= requested_samples) {
        const size_t pretrigger_samples = ((requested_samples - 1U) * trigger_point_index) / (point_count - 1U);
        const size_t posttrigger_samples = requested_samples - pretrigger_samples - 1U;
        int32_t source_min = INT32_MAX;
        int32_t source_max = INT32_MIN;
        int32_t threshold = 0;
        int32_t low_threshold = 0;
        int32_t high_threshold = 0;
        int32_t hysteresis_mv = 0;

        for (size_t i = 0; i < count; i++) {
            const int32_t mv = adc_scope_get_source_sample_locked(trigger_channel_index, circular_source, oldest_start[trigger_channel_index], i);
            if (mv < source_min) {
                source_min = mv;
            }
            if (mv > source_max) {
                source_max = mv;
            }
        }

