bmunizteofilo/esp32s3_oscilloscope_2_channels/main/adc/adc_scope.c
        threshold = (trigger_level_mv == INT32_MIN) ? (source_min + ((source_max - source_min) / 2)) : trigger_level_mv;
        hysteresis_mv = (int32_t)trigger_hysteresis_mv;
        if (hysteresis_mv <= 0) {
            hysteresis_mv = (source_max - source_min) / 20;
            if (hysteresis_mv < 8) {
                hysteresis_mv = 8;
            }
        }

        low_threshold = threshold - (hysteresis_mv / 2);
        high_threshold = threshold + (hysteresis_mv / 2);
        snapshot.trigger_level_mv = threshold;
        snapshot.trigger_hysteresis_mv = (uint32_t)hysteresis_mv;

        if (count > posttrigger_samples + 1U) {
            for (size_t rel = count - posttrigger_samples - 1U; rel > pretrigger_samples; rel--) {
                const int32_t prev = adc_scope_get_source_sample_locked(trigger_channel_index, circular_source, oldest_start[trigger_channel_index], rel - 1U);
                const int32_t curr = adc_scope_get_source_sample_locked(trigger_channel_index, circular_source, oldest_start[trigger_channel_index], rel);
                const bool rising = (prev < low_threshold) && (curr >= high_threshold);
                const bool falling = (prev > high_threshold) && (curr <= low_threshold);

                if ((trigger_mode == ADC_SCOPE_TRIGGER_RISE && rising) ||
                    (trigger_mode == ADC_SCOPE_TRIGGER_FALL && falling)) {
                    window_start = rel - pretrigger_samples;
                    window_len = requested_samples;
                    snapshot.trigger_sample_index = rel - window_start;
                    snapshot.trigger_found = true;
                    break;
                }
            }
        }

        if (!snapshot.trigger_found && trigger_run_mode != ADC_SCOPE_TRIGGER_RUN_AUTO) {
            window_len = 0U;
        }
    } else {
        snapshot.trigger_level_mv = (trigger_level_mv == INT32_MIN) ? 0 : trigger_level_mv;
        snapshot.trigger_hysteresis_mv = trigger_hysteresis_mv;
    }

    snapshot.sample_count = window_len;
    for (size_t i = 0; i < s_scope.config.channel_count; i++) {
        adc_scope_render_window_locked(i,
                                       circular_source,
                                       oldest_start[i],
                                       window_start,
                                       window_len,
                                       dest_per_channel[i],
                                       point_count,
                                       &snapshot.min_mv[i],
                                       &snapshot.max_mv[i]);

        adc_scope_measure_window_locked(i,
                                        circular_source,
                                        oldest_start[i],
                                        window_start,
                                        window_len,
                                        snapshot.trigger_level_mv,
                                        &snapshot.frequency_tenths_hz[i],
                                        &snapshot.duty_tenths_percent[i],
                                        &snapshot.measurements_valid[i]);
    }

    xSemaphoreGive(s_scope.mutex);

    if (out_snapshot != NULL) {
        *out_snapshot = snapshot;
    }

    return ESP_OK;
}

/**
 * @brief Retorna a frequência de amostragem configurada para o ADC.
 *
 * @param[out] out_sample_freq_hz Frequência configurada em hertz.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_get_sample_freq_hz(uint32_t *out_sample_freq_hz)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");
    ESP_RETURN_ON_FALSE(out_sample_freq_hz != NULL, ESP_ERR_INVALID_ARG, TAG, "saida nula");

    *out_sample_freq_hz = s_scope.config.sample_freq_hz;
    return ESP_OK;
}

/**
 * @brief Retorna a quantidade de canais configurados.
 *
 * @param[out] out_channel_count Quantidade de canais habilitados.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_get_channel_count(size_t *out_channel_count)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");
    ESP_RETURN_ON_FALSE(out_channel_count != NULL, ESP_ERR_INVALID_ARG, TAG, "saida nula");

    *out_channel_count = s_scope.config.channel_count;
    return ESP_OK;
}

/**
 * @brief Retorna o GPIO físico associado ao canal ADC configurado.
 *
 * @param[in] channel_index Índice lógico do canal configurado.
 * @param[out] out_gpio GPIO correspondente ao canal configurado.
 *
 * @return `ESP_OK` em caso de sucesso.
 */
esp_err_t adc_scope_get_gpio_num(size_t channel_index, int *out_gpio)
{
    ESP_RETURN_ON_FALSE(s_scope.initialized, ESP_ERR_INVALID_STATE, TAG, "modulo nao inicializado");
    ESP_RETURN_ON_FALSE(out_gpio != NULL, ESP_ERR_INVALID_ARG, TAG, "saida nula");
    ESP_RETURN_ON_FALSE(channel_index < s_scope.config.channel_count, ESP_ERR_INVALID_ARG, TAG, "channel_index invalido");

    *out_gpio = s_scope.gpio_num[channel_index];
    return ESP_OK;
}
